{
    "all_text": [
        "Harrison Taylor",
        "hstaylor@wpi.edu | harrisonstaylor.org | 401-330-8140 | www.linkedin.com/in/harrisontaylor25",
        "OBJECTIVE",
        "Passionate computer science student seeking a full-time position in a relevant field to apply my skillsets in machine learning, scripting, object-oriented programming, software design and development, or systems programming.",
        "EDUCATION",
        "Worcester Polytechnic Institute (WPI), Worcester, MA\t\t\t\t\t             May 2024/2025",
        "Bachelor of Science/Master of Science in Computer Science, GPA 4.0/4.0",
        "EXPERIENCE",
        "Tech Risk Intern, Citizens Bank, Johnston, RI\t\t\t\t\t\t           June 2024 – August 2024",
        "Automated risk analysis and management via Python scripts.",
        "Developed a secure and scalable programming standard for the department.",
        "Aided in rebasing code from local network to Bitbucket.",
        "SKILLS",
        "Programming Languages: Java, C++, Python, C#, C, Oracle, PostgreSQL, CSS, JavaScript, HTML, MySQL",
        "Software Development Tools: AWS, Google Colab, Scikit Learn, TensorFlow, PyCharm IDE, pgAdmin, GitHub, Gradle, Hibernate, Node, WebGL, Android Studio, Pandas, NumPy, PyTorch.",
        "PROJECTS",
        "Sign Sight",
        "Used YOLOV8 to create a machine learning model to identify signs and their types in images and videos.",
        "Developed a secondary model to determine country of origin when provided a photo of a sign.",
        "Software Engineering Application in Collaboration with Brigham and Women’s Hospital",
        "Led the backend development in a team of 10 people, constructing the database utilized by the app.",
        "Designed an app for Brigham and Women’s Hospital utilizing Java, JavaFX, MaterialFX, and PostgreSQL.",
        "Constructed the database for the app using Hibernate ORM and used various design strategies to implement it.",
        "Utilized an Agile Scrum methodology, meeting frequently and generating many iterations.",
        "MERN Task Tracker Web Application",
        "Utilized React, Node.js, Express, and MongoDB to create a simple task tracking web application.",
        "Created urgency metrics, a calendar interface, and a notification system.",
        "Linux Operating System Memory Allocation Tracker",
        "Developed a program to compare different virtual to physical memory techniques utilized by the Linux OS.",
        "Compared performance on virtual machines and real computers.",
        "College Sorting Application User Interface",
        "Developed a GUI and UX for a college sorting application .",
        "Modeled in Canva and Balsamiq to simulate user experience, highlighting accessibility features.",
        "OpenAI Chatbot",
        "Used the OpenAI API in Python to create and finetune a general AI chatbot for a Python application.",
        "Developed Tkinter frontend with simple chat interface.",
        "Evaluation of Database Technologies for Higher Education",
        "Worked with a team of students to write a paper regarding the aptitude of various RDBMSs in academia.",
        "Published a research paper documenting our findings.",
        "Custom Deep Neural Network",
        "Used Python to develop a custom neural network for image recognition across 10 classes.",
        "Utilized variable numbers of hidden layers and types of activation functions.",
        "AWARDS/HONORS",
        "Upsilon Pi Epsilon Member\t\t\t\t\t\t\t\t\t    March 2024 – Present",
        "WPI Dean’s List\t\t\t\t\t\t\t       December 2021, December 2022, May 2023",
        "WPI High Distinction                                                                                                                                              May 2024"
    ]
}